#ifndef HASH_TABLE_UNIT_TESTS_H
#define HASH_TABLE_UNIT_TESTS_H

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

/**
 * @brief Исследует хеш-функции на равномерное распределение коллизий
*/
void TestHashTable_Sheakspear();

/**
 * @brief Нагрузочные тесты для поиска элемента.
*/
void TestHashTable_OptimizationFind();

/**
 * @brief Нагрузочные тесты для вставки и удаления элементов.
*/
void TestHashTable_OptimizationInsertRemove();

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***\\\

#endif // !HASH_TABLE_UNIT_TESTS_H